inventory_service_perf/wrk_report/inventory_python312_read_1200.txt
next_player_id is achive 100000 and reset to 1
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 9.774ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.23ms    4.12ms  87.62ms   79.79%
    Req/Sec     1.23k   365.11     2.63k    58.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.97ms
 75.000%    8.56ms
 90.000%    9.97ms
 99.000%   11.81ms
 99.900%   38.88ms
 99.990%   60.99ms
 99.999%   77.38ms
100.000%   87.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.691     0.000000            1         1.00
       1.380     0.100000        13166         1.11
       1.675     0.200000        26283         1.25
       1.999     0.300000        39428         1.43
       2.513     0.400000        52586         1.67
       3.971     0.500000        65705         2.00
       5.195     0.550000        72282         2.22
       6.271     0.600000        78850         2.50
       7.095     0.650000        85417         2.86
       7.895     0.700000        92000         3.33
       8.559     0.750000        98563         4.00
       8.855     0.775000       101904         4.44
       9.111     0.800000       105223         5.00
       9.327     0.825000       108416         5.71
       9.543     0.850000       111747         6.67
       9.751     0.875000       115087         8.00
       9.855     0.887500       116689         8.89
       9.967     0.900000       118389        10.00
      10.071     0.912500       119917        11.43
      10.199     0.925000       121612        13.33
      10.343     0.937500       123232        16.00
      10.423     0.943750       124078        17.78
      10.511     0.950000       124901        20.00
      10.607     0.956250       125689        22.86
      10.719     0.962500       126475        26.67
      10.847     0.968750       127326        32.00
      10.919     0.971875       127744        35.56
      10.999     0.975000       128140        40.00
      11.079     0.978125       128546        45.71
      11.191     0.981250       128966        53.33
      11.327     0.984375       129354        64.00
      11.399     0.985938       129556        71.11
      11.503     0.987500       129765        80.00
      11.671     0.989062       129967        91.43
      11.919     0.990625       130172       106.67
      15.687     0.992188       130375       128.00
      18.687     0.992969       130478       142.22
      21.439     0.993750       130580       160.00
      23.679     0.994531       130683       182.86
      26.095     0.995313       130786       213.33
      28.543     0.996094       130888       256.00
      29.743     0.996484       130940       284.44
      30.559     0.996875       130991       320.00
      31.919     0.997266       131042       365.71
      33.087     0.997656       131097       426.67
      34.239     0.998047       131145       512.00
      34.847     0.998242       131171       568.89
      35.743     0.998437       131196       640.00
      36.575     0.998633       131223       731.43
      37.503     0.998828       131248       853.33
      38.943     0.999023       131273      1024.00
      40.223     0.999121       131286      1137.78
      41.343     0.999219       131299      1280.00
      42.495     0.999316       131312      1462.86
      43.359     0.999414       131325      1706.67
      45.471     0.999512       131337      2048.00
      46.335     0.999561       131344      2275.56
      47.007     0.999609       131350      2560.00
      48.767     0.999658       131357      2925.71
      50.207     0.999707       131363      3413.33
      52.767     0.999756       131369      4096.00
      54.015     0.999780       131373      4551.11
      54.879     0.999805       131376      5120.00
      55.903     0.999829       131379      5851.43
      56.927     0.999854       131382      6826.67
      58.783     0.999878       131385      8192.00
      59.839     0.999890       131387      9102.22
      62.943     0.999902       131389     10240.00
      63.295     0.999915       131390     11702.86
      65.343     0.999927       131392     13653.33
      66.111     0.999939       131393     16384.00
      66.367     0.999945       131395     18204.44
      66.367     0.999951       131395     20480.00
      66.687     0.999957       131396     23405.71
      70.079     0.999963       131397     27306.67
      70.079     0.999969       131397     32768.00
      75.199     0.999973       131398     36408.89
      75.199     0.999976       131398     40960.00
      76.351     0.999979       131399     46811.43
      76.351     0.999982       131399     54613.33
      76.351     0.999985       131399     65536.00
      77.375     0.999986       131400     72817.78
      77.375     0.999988       131400     81920.00
      77.375     0.999989       131400     93622.86
      77.375     0.999991       131400    109226.67
      77.375     0.999992       131400    131072.00
      87.679     0.999993       131401    145635.56
      87.679     1.000000       131401          inf
#[Mean    =        5.226, StdDeviation   =        4.123]
#[Max     =       87.616, Total count    =       131401]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143745 requests in 2.00m, 62.52MB read
Requests/sec:   1197.87
Transfer/sec:    533.47KB