inventory_service_perf/wrk_report/inventory_python312_write_1000.txt
(venv312) dr@eniac-bench:~/devel/wrk2$ WRK_TEST_NAME=write WRK_TEST_MAX_PLAYER_ID=100000 ./wrk  --latency -t1 -R1000  -c 100 -d 120 -s inventory_bench_wrk.lua http://eniac-bench:8080 
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 151.951ms, rate sampling interval: 976ms
next_player_id is achive 100000 and reset to 1
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.18ms  110.13ms   1.10s    90.60%
    Req/Sec     1.00k    43.81     1.14k    87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.90ms
 75.000%   10.70ms
 90.000%  130.49ms
 99.000%  540.67ms
 99.900%  823.81ms
 99.990%  955.39ms
 99.999%    1.08s 
100.000%    1.10s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.273     0.000000            1         1.00
       5.915     0.100000        10953         1.11
       7.191     0.200000        21930         1.25
       7.991     0.300000        32879         1.43
       8.479     0.400000        43961         1.67
       8.895     0.500000        54962         2.00
       9.095     0.550000        60300         2.22
       9.327     0.600000        65854         2.50
       9.583     0.650000        71198         2.86
       9.967     0.700000        76689         3.33
      10.703     0.750000        82132         4.00
      11.679     0.775000        84865         4.44
      12.967     0.800000        87607         5.00
      14.495     0.825000        90336         5.71
      39.519     0.850000        93079         6.67
      73.343     0.875000        95816         8.00
      90.431     0.887500        97182         8.89
     130.495     0.900000        98550        10.00
     178.047     0.912500        99918        11.43
     219.775     0.925000       101288        13.33
     265.471     0.937500       102661        16.00
     286.207     0.943750       103344        17.78
     310.015     0.950000       104025        20.00
     335.615     0.956250       104713        22.86
     361.471     0.962500       105392        26.67
     393.215     0.968750       106079        32.00
     408.575     0.971875       106425        35.56
     421.887     0.975000       106761        40.00
     437.503     0.978125       107112        45.71
     461.311     0.981250       107449        53.33
     490.751     0.984375       107788        64.00
     503.551     0.985938       107960        71.11
     516.863     0.987500       108130        80.00
     529.919     0.989062       108303        91.43
     547.839     0.990625       108472       106.67
     570.367     0.992188       108644       128.00
     584.191     0.992969       108730       142.22
     601.087     0.993750       108815       160.00
     617.983     0.994531       108902       182.86
     634.367     0.995313       108985       213.33
     654.847     0.996094       109072       256.00
     665.599     0.996484       109116       284.44
     680.959     0.996875       109157       320.00
     699.391     0.997266       109199       365.71
     727.039     0.997656       109242       426.67
     749.567     0.998047       109286       512.00
     757.759     0.998242       109306       568.89
     776.191     0.998437       109327       640.00
     791.039     0.998633       109349       731.43
     806.911     0.998828       109370       853.33
     827.391     0.999023       109392      1024.00
     844.287     0.999121       109402      1137.78
     858.111     0.999219       109413      1280.00
     869.375     0.999316       109424      1462.86
     880.639     0.999414       109434      1706.67
     890.367     0.999512       109445      2048.00
     896.511     0.999561       109450      2275.56
     904.191     0.999609       109456      2560.00
     916.479     0.999658       109463      2925.71
     920.575     0.999707       109466      3413.33
     932.351     0.999756       109472      4096.00
     935.423     0.999780       109474      4551.11
     942.079     0.999805       109477      5120.00
     945.151     0.999829       109480      5851.43
     947.711     0.999854       109482      6826.67
     951.807     0.999878       109485      8192.00
     953.855     0.999890       109486      9102.22
     957.951     0.999902       109488     10240.00
     958.975     0.999915       109490     11702.86
     958.975     0.999927       109490     13653.33
     973.311     0.999939       109492     16384.00
     973.311     0.999945       109492     18204.44
     978.431     0.999951       109493     20480.00
    1032.191     0.999957       109494     23405.71
    1032.191     0.999963       109494     27306.67
    1058.815     0.999969       109495     32768.00
    1058.815     0.999973       109495     36408.89
    1064.959     0.999976       109496     40960.00
    1064.959     0.999979       109496     46811.43
    1064.959     0.999982       109496     54613.33
    1082.367     0.999985       109497     65536.00
    1082.367     0.999986       109497     72817.78
    1082.367     0.999988       109497     81920.00
    1082.367     0.999989       109497     93622.86
    1082.367     0.999991       109497    109226.67
    1103.871     0.999992       109498    131072.00
    1103.871     1.000000       109498          inf
#[Mean    =       45.180, StdDeviation   =      110.125]
#[Max     =     1102.848, Total count    =       109498]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119793 requests in 2.00m, 21.48MB read
Requests/sec:    998.28
Transfer/sec:    183.28KB